---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberCosineProf
source: html/aeb258e2-4d9f-a851-7988-9e3f02c23f3e.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberCosineProf Property

The property labeled "Profile for fiber cosine function" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodFiberCosineProf { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".